{
  "name": "Anne+ Season 1",
  "part": "ANNE0105",
  "lesson": 84,
  "language": "nl",
  "words": [
    {
      "word": "struggle",
      "word_translated": "Struggle (noun) - a situation in which someone finds it difficult to succeed.",
      "sentence": "Ik heb een struggle met het leren van Nederlands.",
      "sentence_translated": "I have a struggle with learning Dutch."
    },
    {
      "word": "mam",
      "word_translated": "Mam (noun) - mother.",
      "sentence": "Mijn mam helpt me bij mijn struggle met het leren van Nederlands.",
      "sentence_translated": "My mom helps me with my struggle to learn Dutch."
    },
    {
      "word": "pak",
      "word_translated": "Pak (verb) - to grab or take hold of something.",
      "sentence": "Ik pak mijn boek en ga leren Nederlands.",
      "sentence_translated": "I grab my book and go learn Dutch."
    },
    {
      "word": "vasthouden",
      "word_translated": "Vasthouden (verb) - to hold on or keep something firmly in one's grasp.",
      "sentence": "Hij pakt zijn telefoon en houdt het vast tijdens de busreis.",
      "sentence_translated": "He grabs his phone and holds it tightly during the bus ride."
    },
    {
      "word": "anderen",
      "word_translated": "Anderen (adjective) - others, different people.",
      "sentence": "Ik wil ook anderen helpen bij hun struggle met Nederlands.",
      "sentence_translated": "I also want to help others with their struggle in Dutch."
    },
    {
      "word": "welkom",
      "word_translated": "Welkom (adjective) - welcome, a feeling of being accepted or invited.",
      "sentence": "Anderen zijn welkom om mee te leren Nederlands.",
      "sentence_translated": "Others are welcome to learn Dutch with us."
    },
    {
      "word": "gatver",
      "word_translated": "Gatver (noun) - an exclamation of frustration or annoyance, similar to 'damn'.",
      "sentence": "Ik zeg gatver als ik mijn boek verlies tijdens het leren.",
      "sentence_translated": "I say 'gatver' when I lose my book while learning."
    },
    {
      "word": "wizard",
      "word_translated": "Wizard (noun) - a person who is very skilled or talented at something.",
      "sentence": "Een Nederlands wizard kan makkelijk praten in de taal.",
      "sentence_translated": "A Dutch wizard can easily speak the language."
    },
    {
      "word": "uittrekken",
      "word_translated": "Uittrekken (verb) - to pull out or extract something from a place.",
      "sentence": "De wizard pakt zijn pen en trekt het uit de tas.",
      "sentence_translated": "The wizard grabs his pen and pulls it out of the bag."
    },
    {
      "word": "praten",
      "word_translated": "Praten (verb) - to talk or converse with someone.",
      "sentence": "Ik wil praten met anderen om mijn Nederlands te verbeteren.",
      "sentence_translated": "I want to talk with others to improve my Dutch."
    }
  ]
}